{
  "title": " Standards",
  "journal": [
    {
      "date": 1545514042564,
      "type": "create",
      "item": {
        "story": "",
        "title": " Standards"
      }
    },
    {
      "type": "fork",
      "date": 1545513934919
    }
  ],
  "story": [
    {
      "type": "markdown",
      "id": "9eac7d0f-b895-4640-952e-9bf4241a6592",
      "text": "For any engineering task, there are numerous ways a given problem can be solved. The more complex the task, the more room for diversity. That's all well and good for a one-off problem, but if a design is meant to be iterated over time, or if an entire industry is solving that same problem, part reuse and , whilst offering their clients a certain amount of simplicity and compatibility between vendors - [https://www.explainxkcd.com/wiki/index.php/927:_Standards www.explainxkcd.com]"
    },
    {
      "type": "html",
      "id": "1176c545-a332-4c0d-a017-c6815886e1c6",
      "text": "<div style='padding: 12px; background:#eee; width:96%; align=centered;'>\n<a href='https://www.explainxkcd.com/wiki/index.php/927:_Standards' target='_blank'>\n<img style='display:block; margin:auto; width:100%;'\nsrc='https://imgs.xkcd.com/comics/standards.png'>\n</a>\n\n<p class=caption>\nFortunately, the charging one has been solved now that we've all standardized on mini-USB. Or is it micro-USB? Shit.\n- [https://www.explainxkcd.com/wiki/index.php/927:_Standards explainxkcd.com]\n</p></div>"
    },
    {
      "type": "markdown",
      "id": "cd1d3ec3-ee10-423d-881c-d430ffe8632a",
      "text": "But, standards have issues of their own. They don't accommodate every  built around competing standards gets burdensome. As a result, someone eventually takes on the challenge of creating a universal standard that everyone can rally around."
    },
    {
      "type": "markdown",
      "id": "b3bfc08b-37be-4efc-b733-e608afc3d376",
      "text": "This almost never works. In many cases, a new standard fails to displace the incumbent standards, eventually loses funding and support, and thus becomes a relic of history. In many other cases, it only penetrates far enough to survive, ironically making the situation messier. The latter situation often ends up becoming cyclical, with new standards periodically rising and failing to gain traction."
    },
    {
      "type": "markdown",
      "id": "5b4c2887-a28a-4d25-a12b-01acc64dc7f5",
      "text": "Three examples are given at the top of the comic: ."
    },
    {
      "type": "markdown",
      "id": "5f5b4951-cb8a-4832-a2a3-a15f5cd93d8b",
      "text": "-   Power adapters are notorious for varying from device to device - partly to try to prevent dangerous voltage/current mismatches, but partly just because manufacturers all chose different adapter designs. Mobile phone chargers have mostly converged on a common USB-based solution, but laptops are still a long way out, despite the adoption of yet another standard,  specification was published and may displace micro-USB, it's gaining ground among laptop manufacturers as well.\n-   Character encoding is, in theory, a solved problem -  have stuck around, continuing to cause weird bugs in old software and websites to this day.\n-   Unlike the other examples, there has been little or no effort by instant messaging companies to make their services interoperable. There's more value to keeping IM as a  chat client, can connect to multiple different services, but there is essentially no way to, for example, send a Twitter message directly to a Skype user."
    }
  ]
}